# SurfaceBackgroundPatternColor Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
OverrideGraphicSettings..::..SurfaceBackgroundPatternColor Property
OverrideGraphicSettings Class See Also
---
The override color of the surface background pattern.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2019
# Syntax
C#
---
```text
public Color SurfaceBackgroundPatternColor { get; }
```

Visual Basic
---
```text
Public ReadOnly Property SurfaceBackgroundPatternColor As Color
	Get
```

Visual C++
---
```text
public:
property Color^ SurfaceBackgroundPatternColor {
	Color^ get ();
}
```

# See Also
OverrideGraphicSettings Class
Autodesk.Revit.DB Namespace